docs/AppsEndpointsSummery1.21.org
#+TITLE: Apps Endpoints Summery for 1.21

* Introduction
  The aim is that all GA API Endpoints should have comnformance tests.
  No new endpoints should be introduced to GA without conformance tests.
  The current technical debt consist of Endpoints introduced in histrical releases without conformance tests.
  A concerted effort by the community, SIG's and ii have helped to remove all techincal debt back to 1.11.
  1.10 & 1.11 have 7 endpoints without conformance test which is currently being addressed.
  The next block of endpoints that need to be addressed is release 1.9 where there is 33 endpoints without conformance test.
  All these endpoints belong to the Apps API group.

  The aim of this document is collect information on tested points and the test the brought them to conformance.
  Collect infromation on untested endpoints and the relasionship between then and also list documentation on those endpoints that will aid in writing conformance tests.

*** Apps endpoints
    According to APISNoop there is a total of 63 GA Apps endpoints at the start of 1.21.
    33 of these endpoints, all released to GA in 1.9 do not have conformance tests.
    The endoints can be broken down in to 5 "families" which are:
    - Deployment
    - Statefulset
    - Replicaset
    - Daemonset
    - ControllerRevision
   We will now list the endoints by families and groups with documentation reference.

**** Deployment
     Untested Endpoints:
    - patchAppsV1NamespacedDeploymentScale
    - readAppsV1NamespacedDeploymentScale
    - replaceAppsV1NamespacedDeploymentScale
      See below for "Scale" endpoints.

    - replaceAppsV1NamespacedDeploymentStatus
      An attempt at conformance testing was made in this [[https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/deployment.go#L337-L358][test]]

**** Statefulset
     Untested Endpoints:
     - patchAppsV1NamespacedStatefulSet
     - patchAppsV1NamespacedStatefulSetScale

     - patchAppsV1NamespacedStatefulSetStatus
     - readAppsV1NamespacedStatefulSetStatus
     - replaceAppsV1NamespacedStatefulSetStatus

     - listAppsV1StatefulSetForAllNamespaces
     - deleteAppsV1CollectionNamespacedStatefulSet

***** StatefulSet Conformance test:
[[https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/statefulset.go#L687-L722][e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b -- [sig-apps] StatefulSet [k8s.io] Basic StatefulSet functionality [StatefulSetBasic] Burst scaling should run to completion even with unhealthy pods [Slow] [Conformance] ]]
-   createAppsV1NamespacedStatefulSet
- 	deleteAppsV1NamespacedStatefulSet
- 	listAppsV1NamespacedStatefulSet
- 	readAppsV1NamespacedStatefulSet
- 	replaceAppsV1NamespacedStatefulSet
[[https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/statefulset.go#L577-L613e2][e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b -- [sig-apps] StatefulSet [k8s.io] Basic StatefulSet functionality [StatefulSetBasic] Scaling should happen in predictable order and halt if any stateful pod is unhealthy [Slow] [Conformance] ]]
-   createAppsV1NamespacedStatefulSet
- 	deleteAppsV1NamespacedStatefulSet
- 	listAppsV1NamespacedStatefulSet
- 	readAppsV1NamespacedStatefulSet
- 	replaceAppsV1NamespacedStatefulSet
[[https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/statefulset.go#L839-L872][e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b -- [sig-apps] StatefulSet [k8s.io] Basic StatefulSet functionality [StatefulSetBasic] should have a working scale subresource [Conformance] ]]
-   createAppsV1NamespacedStatefulSet
- 	deleteAppsV1NamespacedStatefulSet
- 	listAppsV1NamespacedStatefulSet
- 	readAppsV1NamespacedStatefulSet
- 	readAppsV1NamespacedStatefulSetScale
- 	replaceAppsV1NamespacedStatefulSet
- 	replaceAppsV1NamespacedStatefulSetScale
[[https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/statefulset.go#L307-L488][e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b -- [sig-apps] StatefulSet [k8s.io] Basic StatefulSet functionality [StatefulSetBasic] should perform canary updates and phased rolling updates of template modifications [Conformance] ]]
-  createAppsV1NamespacedStatefulSet
- 	deleteAppsV1NamespacedStatefulSet
- 	listAppsV1NamespacedStatefulSet
- 	readAppsV1NamespacedStatefulSet
- 	replaceAppsV1NamespacedStatefulSet
[[https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/statefulset.go#L296-L300][e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b -- [sig-apps] StatefulSet [k8s.io] Basic StatefulSet functionality [StatefulSetBasic] should perform rolling updates and roll backs of template modifications [Conformance] ]]
-  createAppsV1NamespacedStatefulSet
- 	deleteAppsV1NamespacedStatefulSet
- 	listAppsV1NamespacedStatefulSet
- 	readAppsV1NamespacedStatefulSet
- 	replaceAppsV1NamespacedStatefulSet
[[https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/statefulset.go#L729-L830][e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b -- [sig-apps] StatefulSet [k8s.io] Basic StatefulSet functionality [StatefulSetBasic] Should recreate evicted statefulset [Conformance] ]]
-  createAppsV1NamespacedStatefulSet
- 	deleteAppsV1NamespacedStatefulSet
- 	listAppsV1NamespacedStatefulSet
- 	readAppsV1NamespacedStatefulSet
- 	replaceAppsV1NamespacedStatefulSet



