docs/AppsEndpointsSummery1.21.md
- [Introduction](#sec-1)
    - [Apps endpoints](#sec-1-0-1)
    - ["Scale" endpoints for Deployment, Statefulset & Replicaset](#sec-1-0-2)


# Introduction<a id="sec-1"></a>

The aim is that all GA API Endpoints should have conformance tests. No new endpoints should be introduced to GA without conformance tests. The current technical debt consist of Endpoints introduced in historical releases without conformance tests. A concerted effort by the community, SIG's and ii have helped to remove all technical debt back to 1.11. 1.10 & 1.11 have 7 endpoints without conformance tests which are currently being addressed. The next block of endpoints that need to be addressed is release 1.9 where there are 33 endpoints without conformance test. All these endpoints belong to the Apps API group.

The aim of this document is to collect information on tested points and the test the brought them to conformance. Collect information on untested endpoints and the relationship between then and also list documentation on those endpoints that will aid in writing conformance tests.

### Apps endpoints<a id="sec-1-0-1"></a>

According to APISNoop there is a total of 63 GA Apps endpoints at the start of 1.21. 33 of these endpoints, all released to GA in 1.9 do not have conformance tests. The endpoints can be broken down in to 5 "families" which are:

-   Deployment
-   Statefulset
-   Replicaset
-   Daemonset
-   ControllerRevision

We will now list the endpoints by families and groups with documentation reference.

1.  Deployment

    Untested Endpoints:
    
    -   patchAppsV1NamespacedDeploymentScale
    -   readAppsV1NamespacedDeploymentScale
    -   replaceAppsV1NamespacedDeploymentScale See below for "Scale" endpoints.
    
    -   replaceAppsV1NamespacedDeploymentStatus An attempt at conformance testing was made in this [test](https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/deployment.go#L337-L358)

2.  Statefulset

    Untested Endpoints:
    
    -   patchAppsV1NamespacedStatefulSet
    -   patchAppsV1NamespacedStatefulSetScale
    
    -   patchAppsV1NamespacedStatefulSetStatus
    -   readAppsV1NamespacedStatefulSetStatus
    -   replaceAppsV1NamespacedStatefulSetStatus
    
    -   listAppsV1StatefulSetForAllNamespaces
    -   deleteAppsV1CollectionNamespacedStatefulSet
    
    1.  StatefulSet Conformance test:
    
        [e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] StatefulSet [k8s.io] Basic StatefulSet functionality [StatefulSetBasic] Burst scaling should run to completion even with unhealthy pods [Slow] [Conformance] ](https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/statefulset.go#L687-L722)
        
        -   createAppsV1NamespacedStatefulSet
        -   deleteAppsV1NamespacedStatefulSet
        -   listAppsV1NamespacedStatefulSet
        -   readAppsV1NamespacedStatefulSet
        -   replaceAppsV1NamespacedStatefulSet
        
        [e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] StatefulSet [k8s.io] Basic StatefulSet functionality [StatefulSetBasic] Scaling should happen in predictable order and halt if any stateful pod is unhealthy [Slow] [Conformance] ](https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/statefulset.go#L577-L613e2)
        
        -   createAppsV1NamespacedStatefulSet
        -   deleteAppsV1NamespacedStatefulSet
        -   listAppsV1NamespacedStatefulSet
        -   readAppsV1NamespacedStatefulSet
        -   replaceAppsV1NamespacedStatefulSet
        
        [e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] StatefulSet [k8s.io] Basic StatefulSet functionality [StatefulSetBasic] should have a working scale subresource [Conformance] ](https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/statefulset.go#L839-L872)
        
        -   createAppsV1NamespacedStatefulSet
        -   deleteAppsV1NamespacedStatefulSet
        -   listAppsV1NamespacedStatefulSet
        -   readAppsV1NamespacedStatefulSet
        -   readAppsV1NamespacedStatefulSetScale
        -   replaceAppsV1NamespacedStatefulSet
        -   replaceAppsV1NamespacedStatefulSetScale
        
        [e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] StatefulSet [k8s.io] Basic StatefulSet functionality [StatefulSetBasic] should perform canary updates and phased rolling updates of template modifications [Conformance] ](https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/statefulset.go#L307-L488)
        
        -   createAppsV1NamespacedStatefulSet
        -   deleteAppsV1NamespacedStatefulSet
        -   listAppsV1NamespacedStatefulSet
        -   readAppsV1NamespacedStatefulSet
        -   replaceAppsV1NamespacedStatefulSet
        
        [e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] StatefulSet [k8s.io] Basic StatefulSet functionality [StatefulSetBasic] should perform rolling updates and roll backs of template modifications [Conformance] ](https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/statefulset.go#L296-L300)
        
        -   createAppsV1NamespacedStatefulSet
        -   deleteAppsV1NamespacedStatefulSet
        -   listAppsV1NamespacedStatefulSet
        -   readAppsV1NamespacedStatefulSet
        -   replaceAppsV1NamespacedStatefulSet
        
        [e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] StatefulSet [k8s.io] Basic StatefulSet functionality [StatefulSetBasic] Should recreate evicted statefulset [Conformance] ](https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/statefulset.go#L729-L830)
        
        -   createAppsV1NamespacedStatefulSet
        -   deleteAppsV1NamespacedStatefulSet
        -   listAppsV1NamespacedStatefulSet
        -   readAppsV1NamespacedStatefulSet
        -   replaceAppsV1NamespacedStatefulSet

3.  Replicaset

    Untested Endpoints:
    
    -   patchAppsV1NamespacedReplicaSet
    -   replaceAppsV1NamespacedReplicaSet
