docs/AppsEndpointsSummery1.21.org
**** Replicaset
     Untested Endpoints:
    - patchAppsV1NamespacedReplicaSet
    - replaceAppsV1NamespacedReplicaSet

    - listAppsV1ReplicaSetForAllNamespaces
    - deleteAppsV1CollectionNamespacedReplicaSet

    - patchAppsV1NamespacedReplicaSetScale
    - readAppsV1NamespacedReplicaSetScale
    - replaceAppsV1NamespacedReplicaSetScale

    - patchAppsV1NamespacedReplicaSetStatus
    - readAppsV1NamespacedReplicaSetStatus
    - replaceAppsV1NamespacedReplicaSetStatus

***** ReplicaSet Conformance tests:
e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b -- [sig-api-machinery] Garbage collector should orphan RS created by deployment when deleteOptions.PropagationPolicy is Orphan [Conformance]
-  listAppsV1NamespacedReplicaSet
- 	readAppsV1NamespacedReplicaSet
e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b -- [sig-api-machinery] ResourceQuota should create a ResourceQuota and capture the life of a replica set. [Conformance]
-   createAppsV1NamespacedReplicaSet
- 	deleteAppsV1NamespacedReplicaSet
[[https://github.com/kubernetes/kubernetes/blob/1ea29cec9c923f18774092df9c3b7d0de7a193c2/test/e2e/apps/deployment.go#L116-L134][e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b -- [sig-apps] Deployment deployment should delete old replica sets [Conformance] ]]
-   createAppsV1NamespacedReplicaSet
- 	listAppsV1NamespacedReplicaSet
[[https://github.com/kubernetes/kubernetes/blob/1ea29cec9c923f18774092df9c3b7d0de7a193c2/test/e2e/apps/deployment.go#L142-L155][e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b -- [sig-apps] Deployment deployment should support proportional scaling [Conformance] ]]
-  listAppsV1NamespacedReplicaSet
- 	readAppsV1NamespacedReplicaSet
[[https://github.com/kubernetes/kubernetes/blob/1ea29cec9c923f18774092df9c3b7d0de7a193c2/test/e2e/apps/deployment.go#L126-L134][e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b -- [sig-apps] Deployment deployment should support rollover [Conformance] ]]
-  createAppsV1NamespacedReplicaSet
- 	listAppsV1NamespacedReplicaSet
- 	readAppsV1NamespacedReplicaSet
[[https://github.com/kubernetes/kubernetes/blob/1ea29cec9c923f18774092df9c3b7d0de7a193c2/test/e2e/apps/deployment.go#L107-L110][e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b -- [sig-apps] Deployment RecreateDeployment should delete old pods and create new ones [Conformance] ]]
-  listAppsV1NamespacedReplicaSet
[[https://github.com/kubernetes/kubernetes/blob/1ea29cec9c923f18774092df9c3b7d0de7a193c2/test/e2e/apps/deployment.go#L99-L101][e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b -- [sig-apps] Deployment RollingUpdateDeployment should delete old pods and create new ones [Conformance] ]]
-   createAppsV1NamespacedReplicaSet
- 	listAppsV1NamespacedReplicaSet
[[https://github.com/kubernetes/kubernetes/blob/1ea29cec9c923f18774092df9c3b7d0de7a193c2/test/e2e/apps/deployment.go#L163-L463][e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b -- [sig-apps] Deployment should run the lifecycle of a Deployment [Conformance] ]]
-   listAppsV1NamespacedReplicaSet
[[https://github.com/kubernetes/kubernetes/blob/1ea29cec9c923f18774092df9c3b7d0de7a193c2/test/e2e/apps/replica_set.go#L114-L117][e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b -- [sig-apps] ReplicaSet should adopt matching pods on creation and release no longer matching pods [Conformance] ]]
-  createAppsV1NamespacedReplicaSet
[[https://github.com/kubernetes/kubernetes/blob/1ea29cec9c923f18774092df9c3b7d0de7a193c2/test/e2e/apps/replica_set.go#L94-L97][e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b -- [sig-apps] ReplicaSet should serve a basic image on each replica with a public image [Conformance] ]]
-  createAppsV1NamespacedReplicaSet
[[https://github.com/kubernetes/kubernetes/blob/master/test/e2e/scheduling/preemption.go#L533-L671][e2e.test/v1.20.0 (linux/amd64) kubeReplicaSets to verify preemption running pathrnetes/7566c9b -- [sig-scheduling] SchedulerPreemption [Serial] PreemptionExecutionPath runs ReplicaSets to verify preemption running path [Conformance] ]]
-  createAppsV1NamespacedReplicaSet
-  readAppsV1NamespacedReplicaSet





*** "Scale" endpoints for Deployment, Statefulset & Replicaset
   Endpoints repeat across these families and test methods for endpoints could likely be applied to similar endpoints.
   One expample is the "Scale" endpoints.

    - patchAppsV1NamespacedDeploymentScale
    - readAppsV1NamespacedDeploymentScale
    - replaceAppsV1NamespacedDeploymentScale

    - patchAppsV1NamespacedStatefulSetScale

    - patchAppsV1NamespacedReplicaSetScale
    - readAppsV1NamespacedReplicaSetScale
    - replaceAppsV1NamespacedReplicaSetScale

The Scale endoints use 3 verbs, patch, read & replease.
Looking at Statefulset the verbs read and replace is aready covered by this [[https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/statefulset.go#L839-L872][test]]
The statefulsetScale group is only missing a conformance test for patchAppsV1NamespacedStatefulSetScale.
If the Conformance is update to cover all 3 ...Scale endpoints, it is likely the same methods could be applied to Deployment and Replicaset resources.



**** ControllerRevision Endpoints

The ControllerRevision endpoints is the endoints group with the least conformance cover, one endpoint  listAppsV1NamespacedControllerRevision is which seem to be incidentally touched by this [[https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/daemon_set.go#L357-L407][test]].

All these endpoint remain without conformance tests:
   - createAppsV1NamespacedControllerRevision
   - deleteAppsV1NamespacedControllerRevision
   - patchAppsV1NamespacedControllerRevision
   - readAppsV1NamespacedControllerRevision
   - replaceAppsV1NamespacedControllerRevision
   - listAppsV1ControllerRevisionForAllNamespaces
   - deleteAppsV1CollectionNamespacedControllerRevision

