docs/AppsEndpointsSummery1.21.md
    
    -   listAppsV1ReplicaSetForAllNamespaces
    -   deleteAppsV1CollectionNamespacedReplicaSet
    
    -   patchAppsV1NamespacedReplicaSetScale
    -   readAppsV1NamespacedReplicaSetScale
    -   replaceAppsV1NamespacedReplicaSetScale
    
    -   patchAppsV1NamespacedReplicaSetStatus
    -   readAppsV1NamespacedReplicaSetStatus
    -   replaceAppsV1NamespacedReplicaSetStatus
    
    1.  ReplicaSet Conformance tests:
    
        [e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] Garbage collector should orphan RS created by deployment when deleteOptions.PropagationPolicy is Orphan [Conformance] ](https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apimachinery/garbage_collector.go#L506-L558)
        
        -   listAppsV1NamespacedReplicaSet
        -   readAppsV1NamespacedReplicaSet
        
        [e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] ResourceQuota should create a ResourceQuota and capture the life of a replica set. [Conformance] ](https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apimachinery/resource_quota.go#L421-L458)
        
        -   createAppsV1NamespacedReplicaSet
        -   deleteAppsV1NamespacedReplicaSet
        
        [e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] Deployment deployment should delete old replica sets [Conformance] ](https://github.com/kubernetes/kubernetes/blob/1ea29cec9c923f18774092df9c3b7d0de7a193c2/test/e2e/apps/deployment.go#L116-L134)
        
        -   createAppsV1NamespacedReplicaSet
        -   listAppsV1NamespacedReplicaSet
        
        [e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] Deployment deployment should support proportional scaling [Conformance] ](https://github.com/kubernetes/kubernetes/blob/1ea29cec9c923f18774092df9c3b7d0de7a193c2/test/e2e/apps/deployment.go#L142-L155)
        
        -   listAppsV1NamespacedReplicaSet
        -   readAppsV1NamespacedReplicaSet
        
        [e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] Deployment deployment should support rollover [Conformance] ](https://github.com/kubernetes/kubernetes/blob/1ea29cec9c923f18774092df9c3b7d0de7a193c2/test/e2e/apps/deployment.go#L126-L134)
        
        -   createAppsV1NamespacedReplicaSet
        -   listAppsV1NamespacedReplicaSet
        -   readAppsV1NamespacedReplicaSet
        
        [e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] Deployment RecreateDeployment should delete old pods and create new ones [Conformance] ](https://github.com/kubernetes/kubernetes/blob/1ea29cec9c923f18774092df9c3b7d0de7a193c2/test/e2e/apps/deployment.go#L107-L110)
        
        -   listAppsV1NamespacedReplicaSet
        
        [e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] Deployment RollingUpdateDeployment should delete old pods and create new ones [Conformance] ](https://github.com/kubernetes/kubernetes/blob/1ea29cec9c923f18774092df9c3b7d0de7a193c2/test/e2e/apps/deployment.go#L99-L101)
        
        -   createAppsV1NamespacedReplicaSet
        -   listAppsV1NamespacedReplicaSet
        
        [e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] Deployment should run the lifecycle of a Deployment [Conformance] ](https://github.com/kubernetes/kubernetes/blob/1ea29cec9c923f18774092df9c3b7d0de7a193c2/test/e2e/apps/deployment.go#L163-L463)
        
        -   listAppsV1NamespacedReplicaSet
        
        [e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] ReplicaSet should adopt matching pods on creation and release no longer matching pods [Conformance] ](https://github.com/kubernetes/kubernetes/blob/1ea29cec9c923f18774092df9c3b7d0de7a193c2/test/e2e/apps/replica_set.go#L114-L117)
        
        -   createAppsV1NamespacedReplicaSet
        
        [e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] ReplicaSet should serve a basic image on each replica with a public image [Conformance] ](https://github.com/kubernetes/kubernetes/blob/1ea29cec9c923f18774092df9c3b7d0de7a193c2/test/e2e/apps/replica_set.go#L94-L97)
        
        -   createAppsV1NamespacedReplicaSet
        
        [e2e.test/v1.20.0 (linux/amd64) kubeReplicaSets to verify preemption running pathrnetes/7566c9b &#x2013; [sig-scheduling] SchedulerPreemption [Serial] PreemptionExecutionPath runs ReplicaSets to verify preemption running path [Conformance] ](https://github.com/kubernetes/kubernetes/blob/master/test/e2e/scheduling/preemption.go#L533-L671)
        
        -   createAppsV1NamespacedReplicaSet
        -   readAppsV1NamespacedReplicaSet

### "Scale" endpoints for Deployment, Statefulset & Replicaset<a id="sec-1-0-2"></a>

Endpoints repeat across these families and test methods for endpoints could likely be applied to similar endpoints. One expample is the "Scale" endpoints.

-   patchAppsV1NamespacedDeploymentScale
-   readAppsV1NamespacedDeploymentScale
-   replaceAppsV1NamespacedDeploymentScale

-   patchAppsV1NamespacedStatefulSetScale

-   patchAppsV1NamespacedReplicaSetScale
-   readAppsV1NamespacedReplicaSetScale
-   replaceAppsV1NamespacedReplicaSetScale

The Scale endoints use 3 verbs, patch, read & replease. Looking at Statefulset the verbs read and replace is aready covered by this [test](https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/statefulset.go#L839-L872) The statefulsetScale group is only missing a conformance test for patchAppsV1NamespacedStatefulSetScale. If the Conformance is update to cover all 3 &#x2026;Scale endpoints, it is likely the same methods could be applied to Deployment and Replicaset resources.

1.  ControllerRevision Endpoints

    The ControllerRevision endpoints is the endoints group with the least conformance cover, one endpoint listAppsV1NamespacedControllerRevision is which seem to be incidentally touched by this [test](https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/daemon_set.go#L357-L407).
    
    All these endpoint remain without conformance tests:
    
    -   createAppsV1NamespacedControllerRevision
    -   deleteAppsV1NamespacedControllerRevision
    -   patchAppsV1NamespacedControllerRevision
    -   readAppsV1NamespacedControllerRevision
    -   replaceAppsV1NamespacedControllerRevision
    -   listAppsV1ControllerRevisionForAllNamespaces
    -   deleteAppsV1CollectionNamespacedControllerRevision
