docs/AppsEndpointsSummery1.21.org
**** Daemonset Endpoints

There is 11 endpoints in the family of which 6 is touched by 5 Conformance test in with a varying levels of success:
[[https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/daemon_set.go#L277-L350][e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b -- [sig-apps] Daemon set [Serial] should retry creating failed daemon pods [Conformance] ]]
	- deleteAppsV1NamespacedDaemonSet
	- listAppsV1NamespacedDaemonSet
	- readAppsV1NamespacedDaemonSet
[[https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/daemon_set.go#L415-L485][2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b -- [sig-apps] Daemon set [Serial] should rollback without unnecessary restarts [Conformance] ]]
	- deleteAppsV1NamespacedDaemonSet
	- listAppsV1NamespacedDaemonSet
	- readAppsV1NamespacedDaemonSet
	- replaceAppsV1NamespacedDaemonSet
[[https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/daemon_set.go#L177-L220][e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b -- [sig-apps] Daemon set [Serial] should run and stop complex daemon [Conformance] ]]
	- deleteAppsV1NamespacedDaemonSet
  - listAppsV1NamespacedDaemonSet
	- patchAppsV1NamespacedDaemonSet
	- readAppsV1NamespacedDaemonSet
[[https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/daemon_set.go#L149-L169][e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b -- [sig-apps] Daemon set [Serial] should run and stop simple daemon [Conformance] ]]
	- deleteAppsV1NamespacedDaemonSet
	- listAppsV1NamespacedDaemonSet
	- readAppsV1NamespacedDaemonSet
and update strategy is RollingUpdate
[[https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/daemon_set.go#L357-L407][e2e.test/V.20.0 (linux/amd64) kubernetes/7566c9b -- [sig-apps] Daemon set [Serial] should update pod when spec was updated and update strategy is RollingUpdate [Conformance] ]]
	- deleteAppsV1NamespacedDaemonSet
	- listAppsV1NamespacedDaemonSet
	- patchAppsV1NamespacedDaemonSet
	- readAppsV1NamespacedDaemonSet

 The following endpoint still remain without conformance tests:
 - patchAppsV1NamespacedDaemonSetStatus
 - readAppsV1NamespacedDaemonSetStatus
 - replaceAppsV1NamespacedDaemonSetStatus

 - listAppsV1DaemonSetForAllNamespaces

 - deleteAppsV1CollectionNamespacedDaemonSet




