docs/AppsEndpointsSummery1.21.md

2.  Daemonset Endpoints

    There is 11 endpoints in the family of which 6 is touched by 5 Conformance test in with a varying levels of success: [e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] Daemon set [Serial] should retry creating failed daemon pods [Conformance] ](https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/daemon_set.go#L277-L350)
    
    -   deleteAppsV1NamespacedDaemonSet
    -   listAppsV1NamespacedDaemonSet
    -   readAppsV1NamespacedDaemonSet
    
    [2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] Daemon set [Serial] should rollback without unnecessary restarts [Conformance] ](https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/daemon_set.go#L415-L485)
    
    -   deleteAppsV1NamespacedDaemonSet
    -   listAppsV1NamespacedDaemonSet
    -   readAppsV1NamespacedDaemonSet
    -   replaceAppsV1NamespacedDaemonSet
    
    [e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] Daemon set [Serial] should run and stop complex daemon [Conformance] ](https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/daemon_set.go#L177-L220)
    
    -   deleteAppsV1NamespacedDaemonSet
    -   listAppsV1NamespacedDaemonSet
    -   patchAppsV1NamespacedDaemonSet
    -   readAppsV1NamespacedDaemonSet
    
    [e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] Daemon set [Serial] should run and stop simple daemon [Conformance] ](https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/daemon_set.go#L149-L169)
    
    -   deleteAppsV1NamespacedDaemonSet
    -   listAppsV1NamespacedDaemonSet
    -   readAppsV1NamespacedDaemonSet
    
    and update strategy is RollingUpdate [e2e.test/V.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] Daemon set [Serial] should update pod when spec was updated and update strategy is RollingUpdate [Conformance] ](https://github.com/kubernetes/kubernetes/blob/master/test/e2e/apps/daemon_set.go#L357-L407)
    
    -   deleteAppsV1NamespacedDaemonSet
    -   listAppsV1NamespacedDaemonSet
    -   patchAppsV1NamespacedDaemonSet
    -   readAppsV1NamespacedDaemonSet
    
    The following endpoint still remain without conformance tests:
    
    -   patchAppsV1NamespacedDaemonSetStatus
    -   readAppsV1NamespacedDaemonSetStatus
    -   replaceAppsV1NamespacedDaemonSetStatus
    
    -   listAppsV1DaemonSetForAllNamespaces
    
    -   deleteAppsV1CollectionNamespacedDaemonSet
    
    1.  Deployment Conformance tests:
