docs/AppsEndpointsSummery1.21.md
    
        Hyperlinks not added as most of the Deployment endpoints is covered. e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] AdmissionWebhook [Privileged:ClusterAdmin] listing mutating webhooks should work [Conformance] createAppsV1NamespacedDeployment
        
        -   deleteAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] AdmissionWebhook [Privileged:ClusterAdmin] listing validating webhooks should work [Conformance] createAppsV1NamespacedDeployment
        
        -   deleteAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] AdmissionWebhook [Privileged:ClusterAdmin] patching/updating a mutating webhook should work [Conformance] createAppsV1NamespacedDeployment
        
        -   deleteAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] AdmissionWebhook [Privileged:ClusterAdmin] patching/updating a validating webhook should work [Conformance] createAppsV1NamespacedDeployment
        
        -   deleteAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] AdmissionWebhook [Privileged:ClusterAdmin] should be able to deny attaching pod [Conformance] createAppsV1NamespacedDeployment
        
        -   deleteAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] AdmissionWebhook [Privileged:ClusterAdmin] should be able to deny custom resource creation, update and deletion [Conformance] createAppsV1NamespacedDeployment
        
        -   deleteAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] AdmissionWebhook [Privileged:ClusterAdmin] should be able to deny pod and configmap creation [Conformance] createAppsV1NamespacedDeployment
        
        -   deleteAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] AdmissionWebhook [Privileged:ClusterAdmin] should deny crd creation [Conformance] createAppsV1NamespacedDeployment
        
        -   deleteAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] AdmissionWebhook [Privileged:ClusterAdmin] should honor timeout [Conformance] createAppsV1NamespacedDeployment
        
        -   deleteAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] AdmissionWebhook [Privileged:ClusterAdmin] should include webhook resources in discovery documents [Conformance] createAppsV1NamespacedDeployment
        
        -   deleteAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] AdmissionWebhook [Privileged:ClusterAdmin] should mutate configmap [Conformance] createAppsV1NamespacedDeployment
        
        -   deleteAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] AdmissionWebhook [Privileged:ClusterAdmin] should mutate custom resource [Conformance] createAppsV1NamespacedDeployment
        
        -   deleteAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] AdmissionWebhook [Privileged:ClusterAdmin] should mutate custom resource with different stored version [Conformance] createAppsV1NamespacedDeployment
        
        -   deleteAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] AdmissionWebhook [Privileged:ClusterAdmin] should mutate custom resource with pruning [Conformance] createAppsV1NamespacedDeployment
        
        -   deleteAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] AdmissionWebhook [Privileged:ClusterAdmin] should mutate pod and apply defaults after mutation [Conformance] createAppsV1NamespacedDeployment
        
        -   deleteAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] AdmissionWebhook [Privileged:ClusterAdmin] should not be able to mutate or prevent deletion of webhook configuration objects [Conformance] createAppsV1NamespacedDeployment
        
        -   deleteAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] AdmissionWebhook [Privileged:ClusterAdmin] should unconditionally reject operations on fail closed webhook [Conformance] createAppsV1NamespacedDeployment
        
        -   deleteAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] Aggregator Should be able to support the 1.17 Sample API Server using the current Aggregator [Conformance] createAppsV1NamespacedDeployment
        
        -   deleteAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] CustomResourceConversionWebhook [Privileged:ClusterAdmin] should be able to convert a non homogeneous list of CRs [Conformance] createAppsV1NamespacedDeployment
        
        -   deleteAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] CustomResourceConversionWebhook [Privileged:ClusterAdmin] should be able to convert from CR v1 to CR v2 [Conformance] createAppsV1NamespacedDeployment
        
        -   deleteAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] Garbage collector should delete RS created by deployment when not orphaning [Conformance] createAppsV1NamespacedDeployment
        
        -   deleteAppsV1NamespacedDeployment
        -   listAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-api-machinery] Garbage collector should orphan RS created by deployment when deleteOptions.PropagationPolicy is Orphan [Conformance] createAppsV1NamespacedDeployment
        
        -   deleteAppsV1NamespacedDeployment
        -   listAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] Deployment deployment should delete old replica sets [Conformance] createAppsV1NamespacedDeployment
        
        -   listAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] Deployment deployment should support proportional scaling [Conformance] createAppsV1NamespacedDeployment
        
        -   listAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        -   replaceAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] Deployment deployment should support rollover [Conformance] createAppsV1NamespacedDeployment
        
        -   listAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        -   replaceAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] Deployment RecreateDeployment should delete old pods and create new ones [Conformance] createAppsV1NamespacedDeployment
        
        -   listAppsV1NamespacedDeployment
        -   readAppsV1NamespacedDeployment
        -   replaceAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] Deployment RollingUpdateDeployment should delete old pods and create new ones [Conformance] createAppsV1NamespacedDeployment
        
        -   listAppsV1NamespacedDeployment readAppsV1NamespacedDeployment
        
        e2e.test/v1.20.0 (linux/amd64) kubernetes/7566c9b &#x2013; [sig-apps] Deployment should run the lifecycle of a Deployment [Conformance] createAppsV1NamespacedDeployment
        
        -   deleteAppsV1CollectionNamespacedDeployment
        -   listAppsV1DeploymentForAllNamespaces
        -   listAppsV1NamespacedDeployment
        -   patchAppsV1NamespacedDeployment
        -   patchAppsV1NamespacedDeploymentStatus
        -   readAppsV1NamespacedDeploymentStatus
        -   replaceAppsV1NamespacedDeployment
